---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCProductWrapper.Count
source: html/62864705-37b8-8285-76a2-8dc2142724fa.htm
---
# Autodesk.Revit.DB.IFC.IFCProductWrapper.Count Property

The number of objects associated with the IfcProduct in this wrapper.

## Syntax (C#)
```csharp
public int Count { get; }
```